Revit 2027 API
IFCExtrusionCreationData.ExtrusionDirection Property
 The extrusion direction to generate an extrusion.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ ExtrusionDirection { get; set; }
Public Property ExtrusionDirection As XYZ
	Get
	Set
public:
property XYZ^ ExtrusionDirection {
	XYZ^ get ();
	void set (XYZ^ value);
}
member ExtrusionDirection : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace